[
  {
    "role": "Code Coach",
    "company": "The Coder School Berkeley",
    "summary": "I taught students between the ages of 8 to 13 how to code. They learned the basics of Python, Lua, and Javascript. We went over everything from machine learning to building simple games in Scratch. Some examples of the web projects I did with the students:\n- Madlib Website that used the browser’s speak synthesis API\n- Snake game built in React\n- Firebase app with authentication that would store bookmarks.",
    "range": "Dec 2019 - Present"
  },
  {
    "role": "Web Developer",
    "company": "App Strickr",
    "summary": "I built an MVP for people interested in build tutorials that appear on the site they are using. I built this with Svelte and Sapper using firestore for the backend and for hosting the app. The app was built with Github actions. I also built the Chrome extensions and a custom web component to display on the website. The website also used the interact.js for resizing the box where the tutorial was in. I left the startup after the MVP was complete. See an [example here](https://chrome.google.com/webstore/detail/appstickr/lochghpempgmfninfbjinodffefpckaj?hl=en)",
    "range": "Nov 2020 - February 2020"
  },
  {
    "role": "Senior PHP Payment Engineer",
    "company": "Zoosk",
    "summary": "At Zoosk, I was responsible for writing code for sales tax, credit card processing (Adyen), 3DS integration, delayed capture timing, email receipts, and all things payments. I set up our unit test automation. I was also worked on dependency injection to replace the static method calling in our PHP app. Zoosk is visited by millions of users a day.",
    "range": "June 2018 - June 2020"
  },
  {
    "role": "Senior PHP  Engineer",
    "company": "FloSports",
    "summary": "Full Stack PHP Developer mainly focused on security and Stripe subscription integration. My main responsibility was to rewrite the subscription and user authentication system in Symfony. We did this using JWT tokens and refresh tokens. I helped build full suite unit tests and end-to-end tests to ensure that everything worked. I also worked with Backbone and Angular 2 to build their customer service dashboard and contribute to the frontend. Flosports served a huge audience with high-quality video streaming.",
    "range": "March 2015 - Dec 2017"
  },
  {
    "role": "Web Developer",
    "company": "Ventrifuge",
    "summary": "I built a mock-social networking site that helped people find business partners. I used Symfony and Doctrine for the backend. I also used Bootstrap and jQuery for the frontend. We integrated Elasticsearch into a Symfony project in this app demo.",
    "range": "2014 September - 2015 Feb"
  },
  {
    "role": "PHP Developer",
    "company": "Cinsay",
    "summary": "I helped build the frontend and mid-layer of the admin panel for Cinsay. We used HTML5, jquery, jQuery UI, and Twitter Bootstrap as our javascript and CSS libraries. I hooked up a subscription API to our platform that used Soap. I also built and studied Symfony forms and Collections.",
    "range": "2013 October - 2014 September"
  }
]
